// Напишите программу, которая:
// 1. на вход принимает число
// 2. и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num % 2 == 0)
{
    Console.WriteLine($"{num} - четное число.");
}
else
{
    Console.WriteLine($"{num} - не является четным числом.");
}